<?php
/**
 * +----------------------------------------------------------------------
 * 公众号 - 账号配置
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

return [
    [
        // 标识符
        'driver' => 'default',
        // Appid
        'appid' => '',
        // AppSecret
        'appsecret' => '',
        // 一物一码的加密KEY
        'thingyard_key' => '',
        // 消息加解密方式 1【明文模式】 2【兼容模式，安全模式】
        'token_type' => 1,
        // TOKEN
        'token' => '',
        // EncodingAESKey
        'encodingaeskey' => '', 
        // 用户信息返回结果语言版本 zh_CN 简体，zh_TW 繁体，en 英语
        'web_lang' => 'zh_CN',
        // 商户ID
        'mch_id' => '',
        // 支付key
        'pay_key' => '',
    ]
];