<?php
/**
 * +----------------------------------------------------------------------
 * 当微信接口返回值错误时，触发的回调类
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/
namespace wechat\callback;

class Error
{
    /**
     * 回调入口
     * 
     * @param string $url 请求接口
     * @param array $data 请求参数
     * @param array $body 接口返回内容
    */
    public static function handle($url, $data, $body) {
        // 此处可以记录触发信息便于调试
        var_dump($body);
    }
}